
public class Ex3 {

	public static void main(String[] args) {

		/*
		 * 데이터타입(Data Type) = 자료형
		 * - 사용할 데이터의 종류를 구분해 놓은 것
		 * - 기본 데이터타입(Primitive Type = 기본형) 
		 *   참조 데이터타입(Reference Type = 참조형)
		 * 
		 * 1. 기본 데이터타입(8가지)
		 * -------------------------------------------------------------
		 *         1Byte(8bit)  2Byte(16bit)  4Byte(32bit)  8Byte(64bit)
		 * -------------------------------------------------------------
		 * 논리형  boolean
		 * 정수형  byte         short         int           long
		 * 실수형                             float         double
		 * 문자형               char
		 * ------------------------------------------------------------- 
		 * 
		 * < 정수형 데이터타입 표현 범위 >
		 * - 메모리 크기에 따라 표현 가능한 정수의 범위가 달라짐
		 * - byte(1Byte = 8bit) : 2^8 = 256가지 = -128 ~ +127 표현 가능
		 *   short(2Byte = 16bit) : 2^16 = 65536가지 = -32768 ~ +32767 
		 *   int(4Byte = 32bit) : 2^32 = 약 -21억 ~ +21억 => 정수의 기본형 
		 *   long(8Byte = 64bit) : 2^64 = 약 -922경 ~ +922경
		 */
		
		
	}

}
